#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/perfolio/web/runs/run-wL4LExz7QV6dLnrB

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # nomad_job.app will be created
  + resource "nomad_job" "app" {
      + allocation_ids          = (known after apply)
      + datacenters             = [
          + "dc1",
        ]
      + deployment_id           = (known after apply)
      + deployment_status       = (known after apply)
      + deregister_on_destroy   = true
      + deregister_on_id_change = true
      + detach                  = true
      + id                      = (known after apply)
      + jobspec                 = <<-EOT
            job "app" {
              datacenters = ["dc1"]
              type        = "service"
            
              update {
                max_parallel      = 1
                min_healthy_time  = "10s"
                healthy_deadline  = "3m"
                progress_deadline = "10m"
                auto_revert       = true
                canary            = 0
              }
            
              group "app" {
                count = 1
            
                network {
                  port "http" {
                    to = 3000
                  }
                }
            
                restart {
                  attempts = 2
                  interval = "30m"
                  delay    = "15s"
                  mode     = "fail"
                }
            
                task "app" {
                  driver = "docker"
            
                  template {
                    source = "/home/terraform/deploy/.env"
                    destination = "${NOMAD_SECRETS_DIR}/.env"
                    env         = true
                    change_mode = "restart"
                  }
            
                  config {
                    image = "perfolio/web-app"
                    ports = ["http"]
                  }
            
                  service {
                    name = "app"
            
                    tags = [
                      "public",
                      "web",
                      "traefik.enable=true",
                      "traefik.http.routers.app.rule=Host(`app.perfol.io`)",
                    ]
                  }
                }
              }
            }
        EOT
      + modify_index            = (known after apply)
      + name                    = "app"
      + namespace               = "default"
      + region                  = (known after apply)
      + task_groups             = [
          + {
              + count   = 1
              + meta    = (known after apply)
              + name    = "app"
              + task    = [
                  + {
                      + driver        = "docker"
                      + meta          = (known after apply)
                      + name          = "app"
                      + volume_mounts = null
                    },
                ]
              + volumes = null
            },
        ]
      + type                    = "service"
    }

  # nomad_job.website will be created
  + resource "nomad_job" "website" {
      + allocation_ids          = (known after apply)
      + datacenters             = [
          + "dc1",
        ]
      + deployment_id           = (known after apply)
      + deployment_status       = (known after apply)
      + deregister_on_destroy   = true
      + deregister_on_id_change = true
      + detach                  = true
      + id                      = (known after apply)
      + jobspec                 = <<-EOT
            job "website" {
              datacenters = ["dc1"]
              type        = "service"
            
              update {
                max_parallel      = 1
                min_healthy_time  = "10s"
                healthy_deadline  = "3m"
                progress_deadline = "10m"
                auto_revert       = true
                canary            = 0
              }
            
              group "website" {
                count = 1
            
                network {
                  port "http" {
                    to = 3000
                  }
                }
            
                restart {
                  attempts = 2
                  interval = "30m"
                  delay    = "15s"
                  mode     = "fail"
                }
            
                task "website" {
                  driver = "docker"
            
                  config {
                    image = "perfolio/web-website"
                    ports = ["http"]
                  }
            
                  service {
                    name = "website"
            
                    tags = [
                      "traefik.enable=true",
                      "traefik.http.routers.http.rule=Path(`perfol.io`)",
                    ]
                  }
                }
              }
            }
        EOT
      + modify_index            = (known after apply)
      + name                    = "website"
      + namespace               = "default"
      + region                  = (known after apply)
      + task_groups             = [
          + {
              + count   = 1
              + meta    = (known after apply)
              + name    = "website"
              + task    = [
                  + {
                      + driver        = "docker"
                      + meta          = (known after apply)
                      + name          = "website"
                      + volume_mounts = null
                    },
                ]
              + volumes = null
            },
        ]
      + type                    = "service"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @chronark, Action: `pull_request`, Working Directory: ``, Workflow: `Testing`*